html/erlang/concurrency/distributed_programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>分布式编程</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="error_handle.html"> UP </a>
 |
 <a accesskey="H" href="concurrency.html"> HOME </a>
</div><div id="content">
<h1 class="title">分布式编程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb16d51e">分布式模型</a></li>
<li><a href="#org5061e8b">编写一个分布式程序</a></li>
</ul>
</div>
</div>
<pre class="example">
  用Erlang编写分布式程序和编写并发程序只有一步之遥
</pre>

<p>
在分布式Erlang里,可以在远程节点和机器上创建进程。创建出远程进程之后,会看到其他所有的基本函数( send 、 receive和 link 等)都能透明运作在网络中,就像在单个节点上一样
</p>

<pre class="example">
  在本章将介绍用于编写分布式Erlang程序的库与Erlang基本函数
</pre>

<p>
<span class="underline">分布式</span> 程序是那些被设计运行在 <span class="underline">计算机网络</span> 上的程序,并且可以仅靠 <span class="underline">传递消息</span> 来协调彼此的活动。下面是一些想要编写分布式应用程序的原因：
</p>
<ul class="org-ul">
<li><span class="underline">性能</span> ：可以通过安排程序的不同部分在不同的机器上并行运行来让程序跑得更快</li>
<li><span class="underline">可靠性</span> ：可以通过让系统运行在数台机器上来实现容错式系统。如果一台机器出了故障,可以在另一台机器上继续</li>
<li><span class="underline">可扩展性</span> ：随着把应用程序越做越大,即使机器的处理能力再强大也迟早会耗尽。到那时,就必须添加更多的机器来提升处理能力。添加一台新机器应当是一次简单的操作,不需要对应用程序的架构做出大的修改</li>
<li><span class="underline">天生分布式</span> ：许多应用程序天生就是分布式的。如果编写一个多用户游戏或聊天系统,就会有来自世界各地的分散用户。如果在某个地理位置上拥有大量的用户,就会希望把计算资源放置在接近这些用户的地方</li>
<li>fun：我想要编写的fun程序大部分都是分布式的。其中许多涉及与全世界各地的人与机器进行交互</li>
</ul>
<div id="outline-container-orgb16d51e" class="outline-2">
<h2 id="orgb16d51e">分布式模型</h2>
<div class="outline-text-2" id="text-orgb16d51e">
<p>
这里将讨论两种主要的分布式模型：
</p>
<ol class="org-ol">
<li>分布式Erlang：在分布式Erlang里,编写的程序会在Erlang的 <b>节点</b> ( <span class="underline">node</span> )上运行
<ul class="org-ul">
<li>节点：一个独立的Erlang系统,包含一个 <span class="underline">自带地址空间</span> 和 <span class="underline">进程组</span> 的 <b>完整虚拟机</b> 
<ul class="org-ul">
<li>可以在任何节点上创建进程,所有消息传递和错误处理基本函数也都能像在单节点上那样工作</li>
</ul></li>
<li>分布式Erlang应用程序运行在一个 <b>可信环境</b> 中。因为任何节点都可以在其他Erlang节点上执行任意操作,所以这涉及高度的信任
<ul class="org-ul">
<li>虽然分布式Erlang应用程序可以运行在开放式网络上,但它们通常是运行在属于同一个 <span class="underline">局域网的集群</span> 上,并受 <span class="underline">防火墙</span> 保护</li>
</ul></li>
</ul></li>
<li>基于套接字：可以用TCP/IP套接字来编写运行在不可信环境中的分布式应用程序
<ul class="org-ul">
<li>这个编程模型不如分布式Erlang那样强大,但是更安全</li>
</ul></li>
</ol>

<pre class="example">
  如果回想一下前面的内容,就一定还记得构建程序的基本单位是进程。编写分布式Erlang程序是很容易的,要做的就是在正确的机器上创建出进程,然后一切就能像之前那样运作了

  人们都习惯了编写顺序程序,而编写分布式程序通常会困难得多。下面将介绍编写简单分布式程序的若干技巧。这些程序很简单,但是非常有用
</pre>

<p>
接下来将从一些小范例起步。只需先学习两件事,就可以开始创建第一个分布式程序了：
</p>
<ul class="org-ul">
<li>如何启动一个Erlang节点</li>
<li>如何在远程Erlang节点上执行远程过程调用</li>
</ul>
</div>
</div>
<div id="outline-container-org5061e8b" class="outline-2">
<h2 id="org5061e8b">编写一个分布式程序</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
